# -*- coding: utf-8 -*-
name = input("请输入您的名字")
print("Hello")
print(name)
print("欢迎使用云熙无聊做的SCL-90测试系统2.1.2")
print("请在待会测试中，以最近一周内状态来回答系统问题")
print("本系统测试结果仅供参考，测试结果需与实际情况共同参考")
print("请在待会测试中，以最近一周内状态来回答系统问题")
print("否则有可能出现测试结果偏差")
print("SCL-90介绍：")
print("SCL-90症状自评量表是世界上最著名的心理健康测试量表之一，")
print("80年代引入我国，并在精神科和心理健康门诊的临床工作中得到广泛应用。")
print("该量表是以Derogatis编制的Hopkin's病状清单（HSCL1973）为基础编制的。")
print("主要从感觉、情感、思维、意识、行为直到生活习惯、人际关系、饮食睡眠等多种角度，")
print("评定一个人是否有某种心理症状及其严重程度如何。")
print("与其他的自评量表（如SDS、SAS等）相比，有容量大、反映症状丰富，")
print("更能准确刻画受测者的自觉症状特性等优点。")
print("SCL-90作为一种适用面广、包含病理心理症状项目多的自评量表，在临床上具有不可替代的作用，是一种十分有效的评定工具。")
print("适用范围：本测验适用对象为16岁以上的成人。不适合于躁狂症和精神分裂症。")
print("测试时间：无限制，正常需20分钟左右")
input("回车开始测试")
YXZZ = 0
YX = 0
test1 = input("1.头痛--------------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result1 = int(test1)
if result1 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result1
test2 = input("2.神经过敏，心中不踏实-------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result2 = int(test2)
if result2 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result2

test3 = input("3.头脑中有不必要的想法或字句盘旋-----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result3 = int(test3)
if result3 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result3

test4 = input("4.头昏或昏倒---------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result4 = int(test4)
if result4 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result4

test5 = input("5.对异性的兴趣减退----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result5 = int(test5)
if result5 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result5

test6 = input("6.对旁人责备求全------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result6 = int(test6)
if result6 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result6

test7 = input("7.感到别人能控制您的思想-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result7 = int(test7)
if result7 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result7

test8 = input("8.责怪别人制造麻烦----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result8 = int(test8)
if result8 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result8

test9 = input("9.忘性大-------------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result9 = int(test9)
if result9 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result9

test10 = input("10.担心自己的衣饰整齐及仪态的端正---1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result10 = int(test10)
if result10 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result10

test11 = input("11.容易烦恼和激动----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result11 = int(test11)
if result11 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result11

test12 = input("12.胸痛------------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result12 = int(test12)
if result12 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result12

test13 = input("13.害怕空旷的场所或街道-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result13 = int(test13)
if result13 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result13

test14 = input("14.感到自己的精力下降，活动减慢----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result14 = int(test14)
if result14 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result14

test15 = input("15.想结束自己的生命--------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result15 = int(test15)
if result15 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result15

test16 = input("16.听到旁人听不到的声音-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result16 = int(test11)
if result16 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result16

test17 = input("17.发抖------------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result17 = int(test17)
if result17 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result17

test18 = input("18.感到大多数人都不可信任---------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result18 = int(test18)
if result18 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result18

test19 = input("19.胃口不好--------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result19 = int(test19)
if result19 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result19

test20 = input("20.容易哭泣--------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result20 = int(test20)
if result20 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result20

test21 = input("21.同异性相处时感到害羞不自在-----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result21 = int(test21)
if result21 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result21

test22 = input("22.感到受骗，中了圈套或有人想抓住您1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result22 = int(test22)
if result22 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result22

test23 = input("23.无缘无故地突然感到害怕--------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result23 = int(test23)
if result23 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result23

test24 = input("24.自己不能控制地大发脾气--------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result24 = int(test24)
if result24 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result24

test25 = input("25.怕单独出门------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result25 = int(test25)
if result25 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result25

test26 = input("26.经常责怪自己----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result26 = int(test26)
if result26 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result26

test27 = input("27.腰痛-----------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result27 = int(test27)
if result27 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result27

test28 = input("28.感到难以完成任务-------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result28 = int(test28)
if result28 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result28

test29 = input("29.感到孤独--------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result29 = int(test29)
if result29 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result29

test30 = input("30.感到苦闷--------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result30 = int(test30)
if result30 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result30

test31 = input("31.过分担忧--------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result31 = int(test31)
if result31 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result31

test32 = input("32.对事物不感兴趣---------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result32 = int(test32)
if result32 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result32

test33 = input("33.感到害怕--------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result33 = int(test33)
if result33 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result33

test34 = input("34.感情容易受到伤害--------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result34 = int(test34)
if result34 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result34

test35 = input("35.旁人能知道您的私下想法---------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result35 = int(test35)
if result35 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result35

test36 = input("36.感到别人不理解您不同情您-------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result36 = int(test36)
if result36 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result36

test37 = input("37.感到人们对您不友好，不喜欢您----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result37 = int(test37)
if result37 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result37

test38 = input("38.做事必须做得很慢以保证做得正确--1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result38 = int(test38)
if result38 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result38

test39 = input("39.心跳得很厉害-----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result39 = int(test39)
if result39 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result39

test40 = input("40.恶心或胃部不舒服--------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result40 = int(test40)
if result40 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result40

test41 = input("41. 感到比不上他人---------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result41 = int(test41)
if result41 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result41

test42 = input("42. 肌肉酸痛---------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result42 = int(test42)
if result42 > 1:
    YX = YX + 1
    YXZZ42 = result42

test43 = input("43. 感到有人在监视您谈论您---------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result43 = int(test43)
if result43 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result43


test44 = input("44. 难以入睡---------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result44 = int(test44)
if result44 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result44

test45 = input("45. 做事必须反复检查--------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result45 = int(test45)
if result45 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result45

test46 = input("46. 难以作出决定------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result46 = int(test46)
if result46 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result46

test47 = input("47. 怕乘电车、公共汽车、地铁或火车--1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result47 = int(test47)
if result47 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result47

test48 = input("48. 呼吸有困难-------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result48 = int(test48)
if result48 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result48

test49 = input("49. 一阵阵发冷或发热--------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result49 = int(test49)
if result49 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result49

test50 = input("50. 因为感到害怕而避开某些东西、场合或活动1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result50 = int(test50)
if result50 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result50

test51 = input("51. 脑子变空了-------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result51 = int(test51)
if result51 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result51

test52 = input("52. 身体发麻或刺痛---------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result52 = int(test52)
if result52 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result52

test53 = input("53. 喉咙有梗塞感-----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result53 = int(test53)
if result53 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result53

test54 = input("54. 感到对前途没有希望------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result54 = int(test54)
if result54 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result54

test55 = input("55. 不能集中注意力---------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result55 = int(test55)
if result55 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result55

test56 = input("56. 感到身体的某一部分软弱无力-----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result56 = int(test56)
if result56 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result56

test57 = input("57. 感到紧张或容易紧张------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result57 = int(test57)
if result57 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result57

test58 = input("58. 感到手或脚发重----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result58 = int(test58)
if result58 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result58

test59 = input("59. 想到有关死亡的事--------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result59 = int(test59)
if result59 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result59

test60 = input("60. 吃得太多---------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result60 = int(test60)
if result60 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result60

test61 = input("61. 当别人看着您或谈论您时感到不自在-1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result61 = int(test61)
if result61 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result61

test62 = input("62. 有一些不属于您自己的想法-------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result62 = int(test62)
if result62 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result62

test63 = input("63. 有想打人或伤害他人的冲动-------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result63 = int(test63)
if result63 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result63

test64 = input("64. 醒得太早--------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result64 = int(test64)
if result64 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result64

test65 = input("65. 必须反复洗手、点数目或触摸某些东西-1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result65 = int(test65)
if result65 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result65

test66 = input("66. 睡得不稳不深-----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result66 = int(test66)
if result66 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result66

test67 = input("67. 有想摔坏或破坏东西的冲动-------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result67 = int(test67)
if result67 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result67

test68 = input("68. 有一些别人没有的想法或念头-----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result68 = int(test68)
if result68 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result68

test69 = input("69. 感到对别人神经过敏------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result69 = int(test69)
if result69 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result69

test70 = input("70. 在商店或电影院等人多的地方感到不自在-1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result70 = int(test70)
if result70 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result70

test71 = input("71. 感到任何事情都很难做-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result71 = int(test71)
if result71 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result71

test72 = input("72. 一阵阵恐惧或惊恐--------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result72 = int(test72)
if result72 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result72

test73 = input("73. 感到在公共场合吃东西很不舒服----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result73 = int(test73)
if result73 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result73

test74 = input("74. 经常与人争论-----------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result74 = int(test74)
if result74 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result74

test75 = input("75. 单独一人时神经很紧张-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result75 = int(test75)
if result75 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result75

test76 = input("76. 别人对您的成绩没有作出恰当的评价-1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result76 = int(test76)
if result76 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result76

test77 = input("77. 即使和别人在一起也感到孤单------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result77 = int(test77)
if result77 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result77

test78 = input("78. 感到坐立不安心神不宁-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result78 = int(test78)
if result78 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result78

test79 = input("79. 感到自己没有什么价值-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result79 = int(test79)
if result79 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result79

test80 = input("80. 感到熟悉的东西变成陌生或不像是真的-1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result80 = int(test80)
if result80 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result80

test81 = input("81. 大叫或摔东西------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result81 = int(test81)
if result81 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result81

test82 = input("82. 害怕会在公共场合昏倒-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result82 = int(test82)
if result82 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result82

test83 = input("83. 感到别人想占您的便宜-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result83 = int(test83)
if result83 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result83

test84 = input("84. 为一些有关'性'的想法而很苦恼----1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result84 = int(test84)
if result84 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result84

test85 = input("85. 认为应该因为自己的过错而受到惩罚-1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result85 = int(test85)
if result85 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result85

test86 = input("86. 感到要赶快把事情做完-----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result86 = int(test86)
if result86 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result86

test87 = input("87. 感到自己的身体有严重问题--------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result87 = int(test87)
if result87 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result87

test88 = input("88. 从未感到和其他人很亲近----------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result88 = int(test88)
if result88 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result88

test89 = input("89. 感到自己有罪------------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result89 = int(test89)
if result89 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result89

test90 = input("90. 感到自己的脑子有毛病------------1. 没有 2. 很轻 3. 中等 4. 偏重 5. 严重 请输入数字")
result90 = int(test90)
if result90 > 1:
    YX = YX + 1
    YXZZ = YXZZ + result90


"""躯体化"""
JG1 = (result1 + result4 + result12 + result27 + result40 + result42 + result48 + result49 + result52 + result53
       + result56 + result58) / 12


"""强迫症状"""
JG2 = (result3 + result9 + result10 + result28 + result38 + result45 + result46 + result51 + result55 + result65) / 10


"""人际关系敏感"""
JG3 = (result6 + result21 + result34 + result36 + result37 + result41 + result61 + result69 + result73) / 9


"""抑郁"""
JG4 = (result5 + result14 + result15 + result20 + result22 + result26 + result29 + result30 + result31 + result32
       + result54 + result71 + result79) / 13


"""焦虑"""
JG5 = (result2 + result17 + result23 + result33 + result39 + result57 + result72 + result78 + result80 + result86) / 10


"""敌对"""
JG6 = (result11 + result24 + result63 + result67 + result74 + result81) / 6


"""恐怖"""
JG7 = (result13 + result25 + result47 + result50 + result70 + result75 + result82) / 7


"""偏执"""
JG8 = (result8 + result18 + result43 + result68 + result76 + result83) / 6


"""精神病性"""
JG9 = (result7 + result16 + result35 + result62 + result77 + result84 + result85 + result87 + result88 + result90) / 10


"""其他"""
JG10 = (result19 + result44 + result59 + result60 + result64 + result66 + result89) / 7


"""总平均分"""
JG11 = (result1 + result2 + result3 + result4 + result5 + result6 + result7 + result8 + result9 + result10 + result11 +
        result12 + result13 + result14 + result15 + result16 + result17 + result18 + result19 + result20 + result21 +
        result22 + result23 + result24 + result25 + result26 + result27 + result28 + result29 + result30 + result31 +
        result32 + result33 + result34 + result35 + result36 + result37 + result38 + result39 + result40 + result41 +
        result42 + result43 + result44 + result45 + result46 + result47 + result48 + result49 + result50 + result51 +
        result52 + result53 + result54 + result55 + result56 + result57 + result58 + result59 + result60 + result61 +
        result62 + result63 + result64 + result65 + result66 + result67 + result68 + result69 + result70 + result71 +
        result72 + result73 + result74 + result75 + result76 + result77 + result78 + result79 + result80 + result81 +
        result82 + result83 + result84 + result85 + result86 + result87 + result88 + result89 + result90) / 90


"""总分"""
JG12 = (result1 + result2 + result3 + result4 + result5 + result6 + result7 + result8 + result9 + result10 + result11 +
        result12 + result13 + result14 + result15 + result16 + result17 + result18 + result19 + result20 + result21 +
        result22 + result23 + result24 + result25 + result26 + result27 + result28 + result29 + result30 + result31 +
        result32 + result33 + result34 + result35 + result36 + result37 + result38 + result39 + result40 + result41 +
        result42 + result43 + result44 + result45 + result46 + result47 + result48 + result49 + result50 + result51 +
        result52 + result53 + result54 + result55 + result56 + result57 + result58 + result59 + result60 + result61 +
        result62 + result63 + result64 + result65 + result66 + result67 + result68 + result69 + result70 + result71 +
        result72 + result73 + result74 + result75 + result76 + result77 + result78 + result79 + result80 + result81 +
        result82 + result83 + result84 + result85 + result86 + result87 + result88 + result89 + result90)

"""阳性项目数"""
JG13 = YX

"""阴性项目数"""
JG14 = 90 - YX

"""阳性项目平均分"""
JG15 = JG12 / JG13

if JG1 > 0 and JG1 < 0.5:
    JGBG1 = "I ▇▇------------------ I"
elif JG1 >= 0.5 and JG1 < 1:
    JGBG1 = "I ▇▇▇▇---------------- I"
elif JG1 >= 1 and JG1 < 1.5:
    JGBG1 = "I ▇▇▇▇▇▇-------------- I"
elif JG1 >= 1.5 and JG1 < 2:
    JGBG1 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG1 >= 2 and JG1 < 2.5:
    JGBG1 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG1 >= 2.5 and JG1 < 3:
    JGBG1 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG1 >= 3 and JG1 < 3.5:
    JGBG1 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG1 >= 3.5 and JG1 < 4:
    JGBG1 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG1 >= 4 and JG1 < 4.5:
    JGBG1 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG1 >= 4.5:
    JGBG1 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG2 >= 0 and JG2 < 0.5:
    JGBG2 = "I ▇▇------------------ I"
elif JG2 >= 0.5 and JG2 < 1:
    JGBG2 = "I ▇▇▇▇---------------- I"
elif JG2 >= 1 and JG2 < 1.5:
    JGBG2 = "I ▇▇▇▇▇▇-------------- I"
elif JG2 >= 1.5 and JG2 < 2:
    JGBG2 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG2 >= 2 and JG2 < 2.5:
    JGBG2 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG2 >= 2.5 and JG2 < 3:
    JGBG2 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG2 >= 3 and JG2 < 3.5:
    JGBG2 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG2 >= 3.5 and JG2 < 4:
    JGBG2 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG2 >= 4 and JG2 < 4.5:
    JGBG2 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG2 >= 4.5:
    JGBG2 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG3 >= 0 and JG3 < 0.5:
    JGBG3 = "I ▇▇------------------ I"
elif JG3 >= 0.5 and JG3 < 1:
    JGBG3 = "I ▇▇▇▇---------------- I"
elif JG3 >= 1 and JG3 < 1.5:
    JGBG3 = "I ▇▇▇▇▇▇-------------- I"
elif JG3 >= 1.5 and JG3 < 2:
    JGBG3 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG3 >= 2 and JG3 < 2.5:
    JGBG3 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG3 >= 2.5 and JG3 < 3:
    JGBG3 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG3 >= 3 and JG3 < 3.5:
    JGBG3 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG3 >= 3.5 and JG3 < 4:
    JGBG3 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG3 >= 4 and JG3 < 4.5:
    JGBG3 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG3 >= 4.5:
    JGBG3 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG4 >= 0 and JG4 < 0.5:
    JGBG4 = "I ▇▇------------------ I"
elif JG4 >= 0.5 and JG4 < 1:
    JGBG4 = "I ▇▇▇▇---------------- I"
elif JG4 >= 1 and JG4 < 1.5:
    JGBG4 = "I ▇▇▇▇▇▇-------------- I"
elif JG4 >= 1.5 and JG4 < 2:
    JGBG4 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG4 >= 2 and JG4 < 2.5:
    JGBG4 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG4 >= 2.5 and JG4 < 3:
    JGBG4 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG4 >= 3 and JG4 < 3.5:
    JGBG4 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG4 >= 3.5 and JG4 < 4:
    JGBG4 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG4 >= 4 and JG4 < 4.5:
    JGBG4 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG4 >= 4.5:
    JGBG4 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG5 >= 0 and JG5 < 0.5:
    JGBG5 = "I ▇▇------------------ I"
elif JG5 >= 0.5 and JG5 < 1:
    JGBG5 = "I ▇▇▇▇---------------- I"
elif JG5 >= 1 and JG5 < 1.5:
    JGBG5 = "I ▇▇▇▇▇▇-------------- I"
elif JG5 >= 1.5 and JG5 < 2:
    JGBG5 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG5 >= 2 and JG5 < 2.5:
    JGBG5 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG5 >= 2.5 and JG5 < 3:
    JGBG5 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG5 >= 3 and JG5 < 3.5:
    JGBG5 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG5 >= 3.5 and JG5 < 4:
    JGBG5 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG5 >= 4 and JG5 < 4.5:
    JGBG5 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG5 >= 4.5:
    JGBG5 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG6 >= 0 and JG6 < 0.5:
    JGBG6 = "I ▇▇------------------ I"
elif JG6 >= 0.5 and JG6 < 1:
    JGBG6 = "I ▇▇▇▇---------------- I"
elif JG6 >= 1 and JG6 < 1.5:
    JGBG6 = "I ▇▇▇▇▇▇-------------- I"
elif JG6 >= 1.5 and JG6 < 2:
    JGBG6 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG6 >= 2 and JG6 < 2.5:
    JGBG6 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG6 >= 2.5 and JG6 < 3:
    JGBG6 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG6 >= 3 and JG6 < 3.5:
    JGBG6 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG6 >= 3.5 and JG6 < 4:
    JGBG6 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG6 >= 4 and JG6 < 4.5:
    JGBG6 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG6 >= 4.5:
    JGBG6 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG7 >= 0 and JG7 < 0.5:
    JGBG7 = "I ▇▇------------------ I"
elif JG7 >= 0.5 and JG7 < 1:
    JGBG7 = "I ▇▇▇▇---------------- I"
elif JG7 >= 1 and JG7 < 1.5:
    JGBG7 = "I ▇▇▇▇▇▇-------------- I"
elif JG7 >= 1.5 and JG7 < 2:
    JGBG7 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG7 >= 2 and JG7 < 2.5:
    JGBG7 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG7 >= 2.5 and JG7 < 3:
    JGBG7 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG7 >= 3 and JG7 < 3.5:
    JGBG7 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG7 >= 3.5 and JG7 < 4:
    JGBG7 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG7 >= 4 and JG7 < 4.5:
    JGBG7 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG7 >= 4.5:
    JGBG7 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG8 >= 0 and JG8 < 0.5:
    JGBG8 = "I ▇▇------------------ I"
elif JG8 >= 0.5 and JG8 < 1:
    JGBG8 = "I ▇▇▇▇---------------- I"
elif JG8 >= 1 and JG8 < 1.5:
    JGBG8 = "I ▇▇▇▇▇▇-------------- I"
elif JG8 >= 1.5 and JG8 < 2:
    JGBG8 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG8 >= 2 and JG8 < 2.5:
    JGBG8 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG8 >= 2.5 and JG8 < 3:
    JGBG8 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG8 >= 3 and JG8 < 3.5:
    JGBG8 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG8 >= 3.5 and JG8 < 4:
    JGBG8 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG8 >= 4 and JG8 < 4.5:
    JGBG8 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG8 >= 4.5:
    JGBG8 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG9 >= 0 and JG9 < 0.5:
    JGBG9 = "I ▇▇------------------ I"
elif JG9 >= 0.5 and JG9 < 1:
    JGBG9 = "I ▇▇▇▇---------------- I"
elif JG9 >= 1 and JG9 < 1.5:
    JGBG9 = "I ▇▇▇▇▇▇-------------- I"
elif JG9 >= 1.5 and JG9 < 2:
    JGBG9 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG9 >= 2 and JG9 < 2.5:
    JGBG9 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG9 >= 2.5 and JG9 < 3:
    JGBG9 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG9 >= 3 and JG9 < 3.5:
    JGBG9 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG9 >= 3.5 and JG9 < 4:
    JGBG9 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG9 >= 4 and JG9 < 4.5:
    JGBG9 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG9 >= 4.5:
    JGBG9 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG10 >= 0 and JG10 < 0.5:
    JGBG10 = "I ▇▇------------------ I"
elif JG10 >= 0.5 and JG10 < 1:
    JGBG10 = "I ▇▇▇▇---------------- I"
elif JG10 >= 1 and JG10 < 1.5:
    JGBG10 = "I ▇▇▇▇▇▇-------------- I"
elif JG10 >= 1.5 and JG10 < 2:
    JGBG10 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG10 >= 2 and JG10 < 2.5:
    JGBG10 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG10 >= 2.5 and JG10 < 3:
    JGBG10 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG10 >= 3 and JG10 < 3.5:
    JGBG10 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG10 >= 3.5 and JG10 < 4:
    JGBG10 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG10 >= 4 and JG10 < 4.5:
    JGBG10 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG10 >= 4.5:
    JGBG10 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG11 >= 0 and JG11 < 0.5:
    JGBG11 = "I ▇▇------------------ I"
elif JG11 >= 0.5 and JG11 < 1:
    JGBG11 = "I ▇▇▇▇---------------- I"
elif JG11 >= 1 and JG11 < 1.5:
    JGBG11 = "I ▇▇▇▇▇▇-------------- I"
elif JG11 >= 1.5 and JG11 < 2:
    JGBG11 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG11 >= 2 and JG11 < 2.5:
    JGBG11 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG11 >= 2.5 and JG11 < 3:
    JGBG11 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG11 >= 3 and JG11 < 3.5:
    JGBG11 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG11 >= 3.5 and JG11 < 4:
    JGBG11 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG11 >= 4 and JG11 < 4.5:
    JGBG11 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG11 >= 4.5:
    JGBG11 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG12 >= 0 and JG12 < 45:
    JGBG12 = "I ▇▇------------------ I"
elif JG12 >= 45 and JG12 < 90:
    JGBG12 = "I ▇▇▇▇---------------- I"
elif JG12 >= 90 and JG12 < 135:
    JGBG12 = "I ▇▇▇▇▇▇-------------- I"
elif JG12 >= 135 and JG12 < 180:
    JGBG12 = "I ▇▇▇▇▇▇▇▇------------ I"
elif JG12 >= 180 and JG12 < 225:
    JGBG12 = "I ▇▇▇▇▇▇▇▇▇▇---------- I"
elif JG12 >= 225 and JG12 < 270:
    JGBG12 = "I ▇▇▇▇▇▇▇▇▇▇▇▇-------- I"
elif JG12 >= 270 and JG12 < 315:
    JGBG12 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇------ I"
elif JG12 >= 315 and JG12 < 360:
    JGBG12 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇---- I"
elif JG12 >= 360 and JG12 < 405:
    JGBG12 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇-- I"
elif JG12 >= 405:
    JGBG12 = "I ▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇▇ I"

if JG1 >= 0 and JG1 < 1.85:
    JDBG1 = "结果解释：躯体化维度主要反映主观的身体不适感,包括心血管、胃肠道、呼吸等系统的不适,和头痛、背痛、肌肉酸痛、以及焦虑的其他躯体表现。通过测试得知被试自我感觉身体良好。被试者比较善于化解自身的压力，因此很少出现身心症状。 被测者主观感觉身体健康。或许是由于被测试者比较善于化解自身的压力，被测者在生活当中没有感到过大的压力。辅导建议：建议被试经常检查自身的心理压力水平，及时处理蓄积的紧张焦虑情绪，防止这些心理因素躯体化，即表现为各种身体不适感。建议被测试者保持积极、乐观的心态和良好的生活习惯，如注意科学饮食,营养均衡,加强体育锻炼，也不能忽视到医院做定期体检，长期保持身心的健康状态。"
elif JG1 >= 1.85 and JG1 < 3.5:
    JDBG1 = "结果解释：躯体化维度主要反映主观的身体不适感,包括心血管、胃肠道、呼吸等系统的不适,和头痛、背痛、肌肉酸痛、以及焦虑的其他躯体表现。通过测试得知被试目前自我感觉身体上有一些不适。被试在生活当中可能感觉到一些紧张焦虑，没有及时关注自身的心理状况，因此出现一些身体不适。辅导建议：如果你目前经常感到身体上的不适，应该弄清这种身体上不适到底是生理因素还是心理因素引起，可以去医院做一个全面体检，如果经医生检查你并无躯体疾患，那么你这些身体上的不适只是你的一种主观感觉，是由于心理上的不愉快或压力过大造成。如果症状较轻，建议加强体育锻炼，可以在心理老师的指导下，掌握一些简便易行的放松和调节方法，以防躯体症状加重。如果症状较重，建议接收系统的心理咨询和治疗。"
elif JG1 >= 3.5:
    JDBG1 = "结果解释：躯体化维度主要反映主观的身体不适感,包括心血管、胃肠道、呼吸等系统的不适,和头痛、背痛、肌肉酸痛、以及焦虑的其他躯体表现。通过测试得知被试目前自我感觉身体的不适感偏重，可能反映在心血管、肠胃道、呼吸或其他系统以及头痛、背痛、肌肉酸痛或乏力等躯体表现上。被测者在生活中感觉到巨大的压力，而且这些紧张焦虑的情绪日积月累，导致心理因素躯体化，表现为各种身体不适感。辅导建议：如果你目前经常感到身体上的不适，应该弄清这种身体上不适到底是生理因素还是心理因素引起，可以去医院做一个全面体检，如果经医生检查你并无躯体疾患，那么你这些身体上的不适只是你的一种主观感觉，是由于心理上的不愉快或压力过大造成。如果症状较轻，建议加强体育锻炼，可以在心理老师的指导下，掌握一些简便易行的放松和调节方法，以防躯体症状加重。如果症状较重，建议接收系统的心理咨询和治疗。"

if JG2 >= 0 and JG2 < 2.16:
    JDBG2 = "结果解释：" \
            "强迫症状维度主要指那种明知没有必要、但又无法摆脱的无意义的思想、冲动、行为等表现,还有一些比较一般的感知障碍(如'脑子都变空了','记忆力不行'等)。" \
            "通过测试得知被试无墨守陈规、过分疑虑、刻意追求完美的倾向。被测者能够用自然平和的心态面对生活中的得失成败，因此能够保持健康心态。 " \
            "被测者在生活中不存在或很少存在强迫性的想法或行为。" \
            "辅导建议：" \
            "被测者需要保持现在的状态，用自然平和的心态面对生活，保有一颗平常心来面对得失成败, 不要对自己和别人要求太高,不苛求完美，" \
            "保持适当的心理压力水平，这样就比较容易保持健康心态。"
elif JG2 >= 2.16 and JG2 < 3.5:
    JDBG2 = "结果解释：" \
            "强迫症状维度主要指那种明知没有必要、但又无法摆脱的无意义的思想、冲动、行为等表现,还有一些比较一般的感知障碍(如'脑子都变空了','记忆力不行'等)。" \
            "通过测试得知被试有时可能因苛求细节和追求完美，造成了行为和思想上的一些困扰。被测者可能在面对压力时，不能及时调整心态，对自身和他人要求较高，" \
            "造成生活中的困扰。" \
            "辅导建议：" \
            "如果觉得自己喜欢求全责备，可以了解一些必要的心理知识，为今后保持健康的心理奠定基础。在相关心理学知识的指导下，做一些调节和改善，" \
            "以防问题进一步发；若是觉得情况比较严重，可向心理老师求助。平时不要过分克制和自我关注，做事不要过分疑虑，太追求细节和完美，思想老得不到松弛，" \
            "会陷入焦虑、紧张和痛苦中。如果觉得通过自身努力无法改善目前状况，应向心理老师求助。"
elif JG2 >= 3.5:
    JDBG2 = "结果解释：" \
            "强迫症状维度主要指那种明知没有必要、但又无法摆脱的无意义的思想、冲动、行为等表现,还有一些比较一般的感知障碍(如'脑子都变空了','记忆力不行'等)。" \
            "通过测试得知被试因为过于苛求细节和追求完美，对一些事情思虑过度，在行为和思想上出现了较多困扰。被测者性格中可能存在完美主义倾向，对人对己都要求甚高，" \
            "苛求细节，追求完美，给他人和自己都带来较大的困扰。" \
            "辅导建议：" \
            "如果觉得自己喜欢求全责备，可以了解一些必要的心理知识，为今后保持健康的心理奠定基础。在相关心理学知识的指导下，做一些调节和改善，" \
            "以防问题进一步发；若是觉得情况比较严重，可向心理老师求助。平时不要过分克制和自我关注，做事不要过分疑虑，太追求细节和完美，" \
            "思想老得不到松弛，会陷入焦虑、紧张和痛苦中。如果觉得通过自身努力无法改善目前状况，应向心理老师求助。"

if JG3 >= 0 and JG3 < 1.8:
    JDBG3 = "结果解释：" \
            "人际关系敏感维度主要指个人存在的不自在感与自卑感,尤其在与其他人相比较时更突出。自卑感、懊丧,以及人事关系明显相处不好的人,往往是这一维度的高分对象," \
            "与人际交流有关的自我敏感及反相期望也是产生这方面症状的原因。通过测试得知被测者能与别人自由交流、和睦相处，有良好的人际关系。 被测者不存在人际关系敏感的问题。" \
            "辅导建议：" \
            "被测者需要保持现在的状态，在人际关系中保持乐观开朗、自信达观的心境，扩大或拓深与他人的交往。与别人建立稳固，深层次的关系,一方面,亲密关系会给人以价值感和归属感," \
            "会使一个人更容易接纳自我,另一方面,当一个人接纳自我时，被别人接纳就是一件容易的事情。这样就会形成一个良性的循环。"
elif JG3 >= 1.8 and JG3 < 3.5:
    JDBG3 = "结果解释：" \
            "人际关系敏感维度主要指个人存在的不自在感与自卑感,尤其在与其他人相比较时更突出。自卑感、懊丧,以及人事关系明显相处不好的人,往往是这一维度的高分对象," \
            "与人际交流有关的自我敏感及反相期望也是产生这方面症状的原因。通过测试得知被测者通常人际交往范围比较狭窄，朋友的数量有限，还没有掌握起较好的人际交往的技巧。" \
            "辅导建议：" \
            "程度轻者建议尽力去学习一些人际交往的技巧，改善与朋友交往的质量,程度重者建议尽快走出自己的内心世界，尝试着去结交更多的朋友。必要时寻求专业心理老师的帮助。"
elif JG3 >= 3.5:
    JDBG3 = "结果解释：" \
            "人际关系敏感维度主要指个人存在的不自在感与自卑感,尤其在与其他人相比较时更突出。自卑感、懊丧,以及人事关系明显相处不好的人," \
            "往往是这一维度的高分对象,与人际交流有关的自我敏感及反相期望也是产生这方面症状的原因。通过测试得知被测者在人际交往方面亟待提高，" \
            "通常不能主动与周围的人交往，没有特别知心的朋友，难以获得别人的认可。" \
            "辅导建议：" \
            "程度轻者建议尽力去学习一些人际交往的技巧，改善与朋友交往的质量,程度重者建议尽快走出自己的内心世界，尝试着去结交更多的朋友。" \
            "必要时寻求专业心理老师的帮助。"

if JG4 >= 0 and JG4 < 1.8:
    JDBG4 = "结果解释：" \
            "抑郁维度反映的是抑郁苦闷的感情和心境,具有对生活兴趣减退,缺乏活动愿望,丧失活动力等行为特征,包括失望、悲观,与抑郁相联系的其他感知及躯体方面的问题。" \
            "通过测试得知被试没有抑郁症状。被测者积极乐观,在日常生活中能保持快乐明朗的心态。 被测者不存在抑郁症状。" \
            "辅导建议：" \
            "希望被测者在未来的日子里也能够保持快乐明朗的心态，未来的生活中,挫折和烦恼都是不可避免的，有的时候,即使心态健康的人也会出现" \
            "暂时的情绪低落,态度消沉,但这并不可怕，只要认识到这种情绪并且恰当地调节好自己的情绪，选择适当的应对方法，就可以从低沉悲观的情绪中走出来,积极地面对生活的挑战。"
elif JG4 >= 1.8 and JG4 < 3.5:
    JDBG4 = "结果解释：" \
            "抑郁维度反映的是抑郁苦闷的感情和心境,具有对生活兴趣减退,缺乏活动愿望,丧失活动力等行为特征,包括失望、悲观,与抑郁相联系的其他感知及躯体方面的问题。" \
            "通过测试得知被试偶尔有些郁闷、压抑。" \
            "辅导建议：" \
            "被测者在遇到挫折和烦恼时,会出现暂时的情绪低落,态度消沉,但这并不可怕，只要认识到这种情绪并且恰当地调节好自己的情绪,选择适当的应对方法," \
            "就可以从低沉悲观的情绪中走出来,积极地面对生活的挑战。 心情郁闷时，要学会倾诉和宣泄，如果条件许可，你可以了解一些必要的心理知识，" \
            "为今后保持健康的心理奠定基础。在相关心理学知识的指导下，培养积极的认知方式；另外，多给自己一些放松和倾诉的机会，找人倾诉或适当发泄，" \
            "努力去做一些可以让自己有快乐体验的事；制定一些计划目标让自己的生活充实起来。程度较重者，建议尽快接受系统的心理咨询和治疗。"
elif JG4 >= 3.5:
    JDBG4 = "结果解释：" \
            "抑郁维度反映的是抑郁苦闷的感情和心境,具有对生活兴趣减退,缺乏活动愿望,丧失活动力等行为特征,包括失望、悲观,与抑郁相联系的其他感知及躯体方面的问题。" \
            "通过测试得知被试抑郁症状较严重。被测者经常感到抑郁,对任何事情都没有兴趣,不愿意活动,对生活没有信心,感到悲观绝望。" \
            "辅导建议：" \
            "心情郁闷时，要学会倾诉和宣泄，如果条件许可，你可以了解一些必要的心理知识，为今后保持健康的心理奠定基础。在相关心理学知识的指导下，" \
            "培养积极的认知方式；另外，多给自己一些放松和倾诉的机会，找人倾诉或适当发泄，努力去做一些可以让自己有快乐体验的事；" \
            "制定一些计划目标让自己的生活充实起来。程度较重者，建议尽快接受系统的心理咨询和治疗。"

if JG5 >= 0 and JG5 < 1.82:
    JDBG5 = "结果解释：" \
            "焦虑维度包括一些与临床上明显与焦虑症状相联系的症状及体验,一般指那些无法静息、神经过敏、紧张以及由此产生躯体反应(如震颤)。通过测试得知被试无焦虑症状。" \
            "被测试者生活当中的压力感不是很大,或者会以比较适当的方式消除精神压力,被测者需要继续保持心理压力水平。 被测者不存在焦虑症状。" \
            "辅导建议：" \
            "被测试者生活当中的压力感不是很大，或者会以比较适当的方式消除精神压力，被测者需要继续保持心理压力水平。当遇到危急、挫折的时候,一般的人都会产生程度不一的焦虑情绪," \
            "适度的焦虑会使人调动自己的防御机制,应对问题,这是健康的,不需要为之担忧.只有存在较长时间的过度的焦虑才会影响到生活工作并且无助于问题解决,这时才需要加以调节。当今社会，" \
            "人们普遍需要面临巨大的心理压力，容易产生焦虑情绪，因此，即使被测试者当前焦虑水平适中，也应当学习一些控制和消除焦虑的方法，如肌肉放松法、深呼吸法等，" \
            "用以应对突发的紧张的局面，维持自身心理健康状态。"
elif JG5 >= 1.82 and JG5 < 3.5:
    JDBG5 = "结果解释：" \
            "焦虑维度包括一些与临床上明显与焦虑症状相联系的症状及体验,一般指那些无法静息、神经过敏、紧张以及由此产生躯体反应(如震颤)。通过测试得知被试偶尔有些焦虑、烦躁不安的情绪。" \
            "辅导建议：" \
            "被测者在生活中遇到压力时,会产生程度不一的焦虑情绪,适度的焦虑会使人调动自己的防御机制应对问题,这是健康的,不需要为之担忧。只有存在较长时间的、过度的焦虑才会影响到生活工" \
            "作并且无助于问题解决,这时才需要加以调节。 如果常感到焦虑不安，可在相关心理学知识的指导下，掌握一些简便易行的放松方法，自己做一些宣泄和放松，以防焦虑进一步加重。" \
            "另外，也可以找心理老师聊聊。如果自己无法有效调节，建议尽快接受系统的心理咨询和治疗。"
elif JG5 >= 3.5:
    JDBG5 = "结果解释：" \
            "焦虑维度包括一些与临床上明显与焦虑症状相联系的症状及体验,一般指那些无法静息、神经过敏、紧张以及由此产生躯体反应(如震颤)。通过测试得知被试焦虑症状较严重。" \
            "辅导建议：" \
            "被测者在较长时间感到过度的焦虑，并影响到自己正常的生活工作。 如果常感到焦虑不安，可在相关心理学知识的指导下，掌握一些简便易行的放松方法，自己做一些宣泄和放松，" \
            "以防焦虑进一步加重。另外，也可以找心理老师聊聊。如果自己无法有效调节，建议尽快接受系统的心理咨询和治疗。"

if JG6 >= 0 and JG6 < 2.04:
    JDBG6 = "结果解释：" \
            "敌对维度主要从思想、感情及行为等三个方面来反映被试的敌对表现。其项目包括从厌烦、争论、摔物,直至争斗和不可抑制的冲动爆发等各个方面。" \
            "通过测试得知被试具有良好的心态，对很多事情充满包容和理解，情绪较为稳定。被测者友善、豁达的态度，会为自己赢得信任、理解和帮助。" \
            "辅导建议：" \
            "被测者不存在敌对症状。'世界上最宽阔的是海洋,比海洋更宽阔的是天空,比天空更宽阔的是人的心灵.'被测者友善、豁达的态度，会给被测者赢得很多朋友" \
            "，也会让被测者得到很多的信任、理解和帮助。在未来的生活中,保持这种豁达大度,开朗达观的心态, 被测者的生活会充满和谐、快乐。"
elif JG6 >= 2.04 and JG6 < 3.5:
    JDBG6 = "结果解释：" \
            "敌对维度主要从思想、感情及行为等三个方面来反映被试的敌对表现。其项目包括从厌烦、争论、摔物,直至争斗和不可抑制的冲动爆发等各个方面。" \
            "通过测试得知被试有时情绪不稳定，缺乏控制。" \
            "辅导建议：" \
            "被测者对有些事情放不开，碰到此类问题时容易生气，导致情绪不稳定。 如果出现敌对情绪，要注意调节和控制自己的情绪，在愤怒时提醒自己冷静，" \
            "在想要发脾气前要放松自己，例如做深呼吸等，掌握恰当的宣泄和调节方法，让自己逐渐冷静下来。平时就可以试着进行自我心态调节，" \
            "多想想别人的优点和好处，提醒自己多一点容忍和接纳。如果自己无法有效调节，最好能向专业心理老师求助。"
elif JG6 >= 3.5:
    JDBG6 = "结果解释：" \
            "敌对维度主要从思想、感情及行为等三个方面来反映被试的敌对表现。其项目包括从厌烦、争论、摔物,直至争斗和不可抑制的冲动爆发等各个方面。" \
            "通过测试得知被试行为较冲动，经常情绪不稳定，缺乏控制。" \
            "辅导建议：" \
            "被测者的心胸有些狭窄，对人不友善，不够宽容、豁达，生活中缺少朋友。 如果出现敌对情绪，要注意调节和控制自己的情绪，在愤怒时提醒自己冷静，" \
            "在想要发脾气前要放松自己，例如做深呼吸等，掌握恰当的宣泄和调节方法，让自己逐渐冷静下来。平时就可以试着进行自我心态调节，" \
            "多想想别人的优点和好处，提醒自己多一点容忍和接纳。如果自己无法有效调节，最好能向专业心理老师求助。"

if JG7 >= 0 and JG7 < 1.66:
    JDBG7 = "结果解释：" \
            "恐怖维度所表现的症状与传统的恐怖状态或广场恐怖症所反映的内容基本一致,恐惧的对象包括出门旅行、空旷场地、人群、或公共场合及交通工具。" \
            "此外,还有反映社交恐怖的项目,即害怕与他人交往。通过测试得知被试没有恐怖症状。" \
            "辅导建议：" \
            "在某些可怕的情境中感受到恐怖是极为正常的事。生活中每个人都可能偶尔会对某些普通的情境存在畏惧或恐怖的心态的，例如，恐高、恐惧下水等，" \
            "但只要程度不是非常严重，并且不会影响生活，就不必担心。 被测者不存在恐怖症状。在某些可怕的情境中感受到恐怖是极为正常的事。" \
            "生活中每个人都可能偶尔会对某些普通的情境存在畏惧或恐怖的心态的，例如，恐高，恐惧下水等，但只要程度不是非常严重，并且不会影响生活，就不必担心。"
elif JG7 >= 1.66 and JG7 < 3.5:
    JDBG7 = "结果解释：" \
            "恐怖维度所表现的症状与传统的恐怖状态或广场恐怖症所反映的内容基本一致,恐惧的对象包括出门旅行、空旷场地、人群、或公共场合及交通工具。" \
            "此外,还有反映社交恐怖的项目,即害怕与他人交往。通过测试得知被试具有一定的内心恐怖倾向，从某种程度上说，被测者所害怕的事物比正常人要多。" \
            "辅导建议：" \
            "把注意力及能量投向自己生活中有确定意义，且能见成效的事情上，努力做应做之事，把注意力集中在行动上。积极参加集体活动，消除紧张心理，" \
            "锻炼克服困难的意志，培养开朗的性格，增强处理生活事件的能力，学会谅解和宽容别人，控制自己的情绪和主观欲望。如果感到通过自己的努力，" \
            "无法摆脱内心恐惧的倾向，请尽快找心理老师咨询。"
elif JG7 >= 3.5:
    JDBG7 = "结果解释：" \
            "恐怖维度所表现的症状与传统的恐怖状态或广场恐怖症所反映的内容基本一致,恐惧的对象包括出门旅行、空旷场地、人群、或公共场合及交通工具。" \
            "此外,还有反映社交恐怖的项目,即害怕与他人交往。通过测试得知被试在一定程度上反映出类似恐怖症的感受或行为，" \
            "被试内心有很强烈的不安全感，觉得周围环境很不安全，处处充满着恐惧。" \
            "辅导建议：" \
            "把注意力及能量投向自己生活中有确定意义，且能见成效的事情上，努力做应做之事，把注意力集中在行动上。积极参加集体活动，消除紧张心理，" \
            "锻炼克服困难的意志，培养开朗的性格，增强处理生活事件的能力，学会谅解和宽容别人，控制自己的情绪和主观欲望。如果感到通过自己的努力，" \
            "无法摆脱内心恐惧的倾向，请尽快找心理老师咨询。"

if JG8 >= 0 and JG8 < 2:
    JDBG8 = "结果解释：" \
            "偏执是一个十分复杂的概念,本偏执维度主要是指思维方面,如投射性思维、敌对、猜疑、关系观念、妄想、被动体验和夸大等。通过测试得知被试" \
            "个性特征中没有偏执倾向。被试者对周围的人和事能够以客观、理智的态度来对待,不会苛求、走极端。" \
            "辅导建议：" \
            "被测者不存在偏执症状。未来的生活中,被测者需要保持这种态度来看待周围的人和事，保持对自己、对世界的信任。同时被测试者要经常与他人交换" \
            "彼此对事物的看法、意见，了解不同态度存在的必然性，修正自己的一些偏激的看法，使自己更加客观、合理的看待世界。"
elif JG8 >= 2 and JG8 < 3.5:
    JDBG8 = "结果解释：" \
            "偏执是一个十分复杂的概念,本偏执维度主要是指思维方面,如投射性思维、敌对、猜疑、关系观念、妄想、被动体验和夸大等。通过测试得知被试有" \
            "时可能固执、多疑。对一些事情存在偏激的看法，不能客观、合理的看待世界。" \
            "辅导建议：" \
            "应该注意对人对事不要过于敏感和多疑，不要让自己总处于戒备和紧张的状态之中，可在相关心理学知识的指导下调整轻度的偏执思维方式，以防进一" \
            "步加重；多一些宽容，尽量把事情朝好的方面想，努力去相信别人，接纳周围的人和事。如果觉得通过自身努力实在无法改善目前状况，可向心理老" \
            "师求助。"
elif JG8 >= 3.5:
    JDBG8 = "结果解释：" \
            "偏执是一个十分复杂的概念,本偏执维度主要是指思维方面,如投射性思维、敌对、猜疑、关系观念、妄想、被动体验和夸大等。通过测试得知被试个性" \
            "特征中存在固执、多疑的倾向。对于周围的人和事不能以客观、理智的态度对待,喜欢苛求,走极端。存在许多偏激的看法,不容易接受别人的意见。" \
            "辅导建议：" \
            "应该注意对人对事不要过于敏感和多疑，不要让自己总处于戒备和紧张的状态之中，可在相关心理学知识的指导下调整轻度的偏执思维方式，以防进一" \
            "步加重；多一些宽容，尽量把事情朝好的方面想，努力去相信别人，接纳周围的人和事。如果觉得通过自身努力实在无法改善目前状况，可向心理老师求助。"

if JG9 >= 0 and JG9 < 1.71:
    JDBG9 = "结果解释：" \
            "精神病性主要表现为幻听、思维扩散(播散)、被控制感、此外,还有反映非一级症状的精神病表现,如精神分裂症状等项目。通过测试得知被试没有精" \
            "神病倾向。被试能够用稳定的情绪、理性的思维来面对生活和工作,这是精神健康的表现。" \
            "辅导建议：" \
            "被测者不存在精神病性症状。在未来的生活中，需要继续保持这些态度和作法,这对于维持精神的健康至关重要。"
elif JG9 >= 1.71 and JG9 < 3.5:
    JDBG9 = "结果解释：" \
            "精神病性主要表现为幻听、思维扩散(播散)、被控制感、此外,还有反映非一级症状的精神病表现,如精神分裂症状等项目。通过测试得知被试有些表" \
            "现可能需要引起注意。被测者可能遭遇到生活事件一时难以接受,不能及时有效的调整自己的心态,出现一些异常表现。" \
            "辅导建议：" \
            "如果出现精神病倾向，尽快找心理老师咨询。必要时转介至精神卫生机构进行治疗。"
elif JG9 >= 3.5:
    JDBG9 = "结果解释：" \
            "存在可疑症状。被测者可能遭受到重大创伤事件，身心受挫，导致出现异常症状，要非常重视。" \
            "辅导建议：" \
            "如果出现精神病倾向，尽快找心理老师咨询。必要时转介至精神卫生机构进行治疗。"

if JG10 >= 0 and JG10 < 2:
    JDBG10 = "结果解释：" \
            "此维度主要用来反应睡眠、饮食及自罪感等方面的情况,通过测试得知被试在睡眠、饮食及自罪观念方面的心理状况，属于健康水平。" \
            "辅导建议：" \
            "被试在睡眠、饮食及自罪感等方面无异常表现，建议被试在日后继续保持良好睡眠、饮食的生活习惯，同时请关注心理咨询中心举办的活动" \
            "和心理健康讲座。"
elif JG10 >= 2 and JG10 < 3.5:
    JDBG10 = "结果解释：" \
            "此维度主要用来反应睡眠、饮食及自罪感等方面的情况,通过测试得知被试在反映睡眠、饮食以及自罪观念等方面的心理状况中，状况比较健康。" \
            "辅导建议：" \
            "平时要注意保证睡眠和休息时间，培养良好的饮食习惯。如有失眠或自罪观念的问题，请与心理老师取得联系，获得心理老师的帮助。"
elif JG10 >= 3.5:
    JDBG10 = "结果解释：" \
            "此维度主要用来反应睡眠、饮食及自罪感等方面的情况,通过测试得知被试在睡眠、饮食、自罪观念方面存在一定的心理障碍，需要引起注意。" \
            "辅导建议：" \
            "要注意劳逸结合，保证良好的睡眠和休息时间，长期缺乏睡眠极易引起疲劳，注意力不集中，睡眠与健康工作和学习的关系甚为密切。" \
            "注意饮食健康，培养良好的饮食习惯。如有失眠或自罪观念的问题，请及时与心理老师取得联系，获得心理老师的帮助。"

if JG12 >= 0 and JG12 < 160:
    JDBG12 = "结果解释：" \
             "从健康水平良好，被测试者很少因为心理的原因而引起的身体不适感,如感到呼吸困难,心跳加速,身体疼痛,体力缺乏,精神疲惫等情况；" \
             "也很少有明知没有必要却又摆脱不了的强迫性的想法或者行为；总体而言，基本上能够以比较积极健康的心态和情绪来面对生活,可以比较" \
             "好地处理生活中的挫折和压力,基本良好地适应社会生活,能从工作和生活当中获得一定的快乐和满足，对自己的人生有价值感和幸福感。 被" \
             "测者的心理健康状况良好，这是非常值得恭贺的。被测者需要继续保持平和,乐观,开朗的心态面对生活。注意维护自身心理健康状态的平衡。"
elif JG12 >= 160:
    JDBG12 = "心理健康状况需要引起注意。被测试者可能因为心理的原因引起身体症状，出现身体疼痛、体力缺乏、精神疲惫等情况，有时可能会因为正常" \
             "的社会或生活压力而出现焦虑不安,悲伤难过,过分自卑,回避与人的交往以及偏执自负,对他人存有敌意,怀疑等情况；严重者甚至会有异常" \
             "的恐怖和悲观忧郁情绪或者精神异常表现；经常出现失眠,食欲不振等情况。总体而言，评估结果显示受测者在近一阶段遇到了一些问题，可" \
             "能对正常生活、学习构成了一定影响，需要引起重视。 请在必要时要关注自己的心理健康。健康的心态需要积极向上的人生观做支撑,也需要" \
             "较强的自信心作保障。因此，被测者要培养乐观向上的人生观，树立自信心。另外还需要掌握一些社会生活中的技巧,如适当地释放压力,保持" \
             "良好人际关系等等。 建议被测试者在在日常生活当中要积极进取，自强不息，保持良好的社会竞争力，应对当今巨大的社会竞争压力；还要多" \
             "与人为善，建立起完善的人际网络作为自己心理支持的后盾；此外要注意掌握一些心理保健知识和心理调节技能，在必要时进行自我调节，维" \
             "护自身心理健康状况的平衡。如果觉得靠自己的努力不奏效，建议接受心理专家的帮助。"

if JG11 >= 0 and JG11 < 1.84:
    JDBG11 ="结果解释：" \
             "被试心理健康水平良好，基本上能够以比较积极健康的心态和情绪来面对生活,可以比较好地处理生活中的挫折和压力,基本良好地适应社会生活," \
             "能从工作和生活当中获得一定的快乐和满足，对自己的人生有价值感和幸福感。" \
             "辅导建议：" \
             "继续保持平和,乐观,开朗的心态面对生活。注意维护自身心理健康状态的平衡。"
elif JG11 >= 1.87:
    JDBG11 = "结果解释：" \
             "被试的心理健康状况需要引起注意。被试的（ABCDEFGHIJ中哪几项超出正常成人常模），可能对正常生活、学习构成了一定影响，需关注。" \
             "辅导建议：" \
             "被试在在日常生活当中要积极进取，自强不息，保持良好的社会竞争力，应对当今巨大的社会竞争压力；还要多与人为善，建立起完善的人际网" \
             "络作为自己心理支持的后盾；此外要注意掌握一些心理保健知识和心理调节技能，在必要时进行自我调节，维护自身心理健康状况的平衡。如果" \
             "觉得靠自己的努力不奏效，建议接受心理专家的帮助。"


print("----------报告分数----------")

print("躯体化-------", JG1,)

print("强迫症状-----", JG2,)

print("人际关系敏感-", JG3,)

print("抑郁---------", JG4,)

print("焦虑---------", JG5,)

print("敌对---------", JG6,)

print("恐怖---------", JG7,)

print("偏执---------", JG8,)

print("精神病性-----", JG9,)

print("其他---------", JG10,)

print("总平均分-----", JG11,)

print("总分---------", JG12,)

print("阳性项目数---", JG13,)

print("阴性项目数---", JG14,)

print("阳性项目平均分", JG15,)

print("----------图形报告----------")

print("躯体化-------", JGBG1,)

print("强迫症状-----", JGBG2,)

print("人际关系敏感-", JGBG3,)

print("抑郁---------", JGBG4,)

print("焦虑---------", JGBG5,)

print("敌对---------", JGBG6,)

print("恐怖---------", JGBG7,)

print("偏执---------", JGBG8,)

print("精神病性-----", JGBG9,)

print("其他---------", JGBG10,)

print("总平均分-----", JGBG11,)

print("总分---------", JGBG12,)

print("---------解毒与建议---------")

print("躯体化-------", JDBG1,)

print("强迫症状-----", JDBG2,)

print("人际关系敏感-", JDBG3,)

print("抑郁---------", JDBG4,)

print("焦虑---------", JDBG5,)

print("敌对---------", JDBG6,)

print("恐怖---------", JDBG7,)

print("偏执---------", JDBG8,)

print("精神病性-----", JDBG9,)

print("其他---------", JDBG10,)

print("总分---------", JDBG11,)

print("总平均分-----", JDBG12,)